app/controllers/questions_controller.rb

INSERT INTO "questions" ("title", "body", "resolved", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "new question"], ["body", "questions"], ["resolved", "f"], ["created_at", "2016-01-15 14:28:04.186989"], ["updated_at", "2016-01-15 14:28:04.186989"]]
---
  def create
    @question = Question.new
    @question.title = params[:question][:title]
    @question.body = params[:question][:body]
    @question.resolved = params[:question][:resolved]
    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "questions" SET "resolved" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["resolved", "t"], ["updated_at", "2016-01-15 14:25:31.610637"], ["id", 1]]
---
  def update
    @question = Question.find(params[:id])
    @question.title = params[:question][:title]
    @question.body = params[:question][:body]
    @question.resolved = params[:question][:resolved]
    if @question.save

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]
---
  def destroy
    @question = Question.find(params[:id])
    if @question.destroy